/*
 *  -----------------------
 * |  |  |  |  |  |  |  |  |
 *  -----------------------
 * |  |  |  |  |  |  |  |  |
 *  -----------------------
 *  使用2*1的小矩形去遮盖8*2的大矩形，共有多少种覆盖方法？
 *  
 *  可以横放，一旦横着放，下方的就必须横放,还剩下6个位置f(6)
 *  -----------------------
 * | 1| 1|  |  |  |  |  |  |
 *  -----------------------
 * | 2| 2|  |  |  |  |  |  |
 *  -----------------------
 *  可以竖着放，还剩下7个位置f(7)
 *  
 *  -----------------------
 * | 1|  |  |  |  |  |  |  |
 *  -----------------------
 * | 1|  |  |  |  |  |  |  |
 *  -----------------------
 *  
 *  一共f(7)+f(6)还是斐波那契
 */
public class CoverRect {

	public int RectCover(int target) {
        if (target == 1 || target == 2) {
            return target;
        }

        int rect1 = 1;
        int rect2 = 2;

        int rectN = 0;

        for (int i = 3; i <= target; i++) {
            rectN = rect1 + rect2;

            rect1 = rect2;
            rect2 = rectN;
        }

        return rectN;
    }
}
